
// 10 Игра «Угадай число». 

// Предложить пользователю загадать число от 0 до 100 и отгадать его следующим способом: 
// каждую итерацию цикла делите диапазон чисел пополам, 
   

   
  
//    for (a = 'Yes' )


  alert('Загадать число от 0 до 100');
  
  
   let minN  = 0;
   let maxN = 100;
      
   while (b !== ItsMyNumber);


 (1) let N = maxN / 2; 


 (2)  maxN = N; 
 (3)  N = maxN / 2; 
 (4)
 (5)






   let  a = prompt(`Ваше чило більше? ${minN} Yes/No/ItsMyNumber`);
   console.log(a)
   
   



//    цикл - 100 / 2 (n/2)
   
// // записываете результат в N и 
   
// // спрашиваете у пользователя 
//     «Ваше число > N,
//      < N или == N?». 
   
// // В зависимости от того, что указал пользователь, уменьшаете диапазон. 
   
// // Начальный диапазон от 0 до 100, поделили пополам и получили 50. 
   
// // Если пользователь указал, что его число > 50, то изменили диапазон на от 51 до 100. 
   
// // И так до тех пор, пока пользователь не выберет == N.

     